## Pandas - DataFrame and Series

Pandas is powerful data manipulation library in Python, widely used for **Data Analysis and Data Cleaning**.

It provides two primary data structures: **Series and Data Frames**. 

A **Series** is a one dimensional array like object, while **Data Frames** is a two dimensional, Size Mutable, and potenstially heterogeneous tabular data structure with labeled axes (rows and columns)

In [2]:
import pandas as pd

In [3]:
series =pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
print(type(series))

<class 'pandas.core.series.Series'>

In [5]:
# Create a Series from Dictionary
data = {
    'a':1,
    'b':2,
    'c':3
}

seriesDictionary  = pd.Series(data)

In [6]:
print(seriesDictionary)

a    1
b    2
c    3
dtype: int64

In [7]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data, index= index)

a    10
b    20
c    30
dtype: int64

In [8]:
# Data Frame

# Creates a DataFrame from a dictionary of list
data = {
    'Name': ["Shivam", "Varun", "Tanuj", "Sumit", "Sameer"],
    'Age' : [19, 18, 21, 19, 19],
    'City': ["Rohtak", "Jind", "Sonipat", "Panipat", "Ambala"]
}

In [9]:
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  Shivam   19   Rohtak
1   Varun   18     Jind
2   Tanuj   21  Sonipat
3   Sumit   19  Panipat
4  Sameer   19   Ambala
<class 'pandas.core.frame.DataFrame'>

In [10]:
import numpy as np

np.array(df)

array([['Shivam', 19, 'Rohtak'],
       ['Varun', 18, 'Jind'],
       ['Tanuj', 21, 'Sonipat'],
       ['Sumit', 19, 'Panipat'],
       ['Sameer', 19, 'Ambala']], dtype=object)

In [12]:
data = pd.read_csv("Details.csv")

In [13]:
data.head(5)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [14]:
data.tail(5)

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [15]:
# Accessing Data from Database
df

     Name  Age     City
0  Shivam   19   Rohtak
1   Varun   18     Jind
2   Tanuj   21  Sonipat
3   Sumit   19  Panipat
4  Sameer   19   Ambala

In [16]:
df["Name"]

0    Shivam
1     Varun
2     Tanuj
3     Sumit
4    Sameer
Name: Name, dtype: object

In [17]:
print(type(df["Name"]))

<class 'pandas.core.series.Series'>

In [ ]:
df.loc[0]           # Zeroth (Oth) Row

Name    Shivam
Age         19
City    Rohtak
Name: 0, dtype: object

In [19]:
df.loc[3]

Name      Sumit
Age          19
City    Panipat
Name: 3, dtype: object

In [21]:
df.iloc[0][0]

C:\Users\DELL\AppData\Local\Temp\ipykernel_11476\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Shivam'

In [23]:
# Accessing a Specified Element
df.at[1,"Age"]

np.int64(18)

In [24]:
# Accessing a specified element using iat
df.iat[2,2]

'Sonipat'